
* ebench - An extensible toolset to control e-instruments $Release:0.0.10-SNAPSHOT$
:PROPERTIES:
:TOC:      :include all
:END:

:CONTENTS:
- [[#ebench---an-extensible-toolset-to-control-e-instruments-release0010-snapshot][ebench - An extensible toolset to control e-instruments $Release:0.0.10-SNAPSHOT$]]
  - [[#problem-statement][Problem Statement]]
  - [[#study-of-viability-in--ebench--toolset][Study of Viability in  ebench -Toolset]]
    - [[#ebmenu][ebMenu]]
    - [[#ebunit][ebUnit]]
    - [[#ebrigol][ebRigol]]
  - [[#tbd-architecture][TBD Architecture]]
  - [[#documentation-references][Documentation references]]
  - [[#installation][Installation]]
    - [[#clone-repo-httpsgithubcomjarjukebench][Clone repo https://github.com/jarjuk/ebench]]
    - [[#check-ebench-version--file][Check ebench VERSION -file]]
    - [[#check-release-notes][Check release notes]]
    - [[#install-ebench][Install ebench]]
    - [[#check-installation][Check installation]]
    - [[#check-list-resources][Check list resources]]
    - [[#use-it][Use it]]
  - [[#tbd-usage][TBD Usage]]
    - [[#interactive-usage][Interactive usage]]
    - [[#command-line-usage][Command line usage]]
    - [[#api-usage][API usage]]
:END:

** Problem Statement

- As an electronics hobbyist need to control diverse electronic
  instruments
  - to set up instruments in various configurations
  - to collect data in projects for further processing and
    documentation

- with the objective to reap benefits
  - ab initio by having configuration setups and data collection
    actions documented
  - and thenceforth being able to automate setup construction and data
    collection with the help of scripts

- with gently sloping adoption curve
  - where instruments can be operated using interactive interface
  - or command line interface
  - and individual tools can be configured to work together in user
    and API interfaces
  - allowing tool sessions to be exported for scripting for advanced
    use

- be prepared for implementation as on-going work to integrate tools
  created by
  - fellow hobbyists
  - future me

- to build an electronic instrumentation system characterized by
  - strict focus on instrument setup and data collection
  - ease of use 
  - low maintenance
  - high flexibility
  - and high service value


** Study of Viability in  ~ebench~ -Toolset

   The vision presented in the previous chapter is abstract and it
   must be materialized for implementation.  Meet ~ebench~ -toolset, a
   viability study, which, at this time, comprises following three
   tools:

   - ~ebMenu~ : Menu of ebench toolset
   - ~ebUnit~ : Tool to control UNIT-T UTG962/932 Waveform generator
   - ~ebRigol~ : Tool to control Rigol MSO1104Z osciloscope

   Characteristics of ~ebench~ toolset lists:
   - scope core architecture to the minimum and identify a set of
     infrastructure services
   - interactive, command line and API -interfaces implementable in
     one go
   - use Python as core implementation language and existing libraries
     for [[https://pyvisa.readthedocs.io/en/latest/][instrument integrations]] and [[https://pypi.org/project/absl-py/][configuration]] interfaces

   List of features mainained in [[file:FEATURES.org]]

*** ~ebMenu~
#+BEGIN_SRC bash :eval no-export :results output :noweb yes :exports results
ebMenu ?
#+END_SRC

#+RESULTS:
#+begin_example
ebMenu: Menu of ebench toolset

Usage: ebMenu [options] [commands and parameters] 

Commands:

        skooppi  : Rigol osciloscope control
           sgen  : UNIT-T UTG962 signal generator control
       counters  : Read hello.py counters
   counters2csv  : Save hello.py counters to example.csv
              q  : Exit
----------   Other    ----------
              ?  : List commands
             ??  : List command parameters
              !  : Start recording
              .  : Stop recording
#+end_example


*** ~ebUnit~

#+BEGIN_SRC bash :eval no-export :results output :noweb yes :exports results
ebUnit ?
#+END_SRC

#+RESULTS:
#+begin_example
ebUnit: Tool to control UNIT-T UTG962/932 Waveform generator

Usage: ebUnit [options] [commands and parameters] 

Commands:

           sine  : Generate sine -wave on channel 1|2
         square  : Generate square -wave on channel 1|2
          pulse  : Generate pulse -wave on channel 1|2
           ramp  : Generate ramp -wave on channel 1|2
            arb  : Upload wave file and use it to generate wave on channel 1|2
             on  : Switch on channel 1|2
            off  : Switch off channel 1|2
          reset  : Send reset to UTG900 signal generator
----------   Record   ----------
              !  : Start recording
              .  : Stop recording
         screen  : Take screenshot
 list_resources  : List pyvisa resources (=pyvisa list_resources() wrapper)'
----------    Help    ----------
              q  : Exit
              ?  : List commands
             ??  : List command parameters

More help:
  ebUnit --help                          : to list options
  ebUnit ? command=<command>             : to get help on command <command> parameters

Examples:
  ebUnit ? command=sine                  : help on sine command parameters
  ebUnit list_resources                  : Identify --addr option parameter
  ebUnit --addr 'USB0::1::2::3::0::INSTR': Run interactively on device found in --addr 'USB0::1::2::3::0::INSTR'
  ebUnit --captureDir=pics screen        : Take screenshot to pics directory (form device in default --addr)
  ebUnit reset                           : Send reset to UTH900 waveform generator
  ebUnit sine channel=2 freq=2kHz        : Generate 2 kHz sine signal on channel 2
  ebUnit sine channel=1 square channel=2 : chaining sine generation on channel 1, and square generation on channel 2

Hint:
  Run reset to synchronize ebUnit -tool with device state. Ref= ?? command=reset
  One-liner in linux: ebUnit --addr $(ebUnit list_resources)


#+end_example



*** ~ebRigol~

#+BEGIN_SRC bash :eval no-export :results output :noweb yes :exports results
ebRigol ?
#+END_SRC

#+RESULTS:
#+begin_example
ebRigol: Tool to control Rigol MSO1104Z osciloscope

Usage: ebRigol [options] [commands and parameters] 

Commands:

----------    Init    ----------
        general  : General setup
          setup  : Setup channel
   setupTrigger  : Setup trigger
       timebase  : Setup timebase
       podSetup  : Setup digical channels
         podOff  : Setup digical channels
             on  : Open channel
            off  : Close channel
           stat  : Set statistics
      statClear  : Clear statistics
          reset  : Send reset to Rigol
          clear  : Send clear to Rigol
----------  Measure   ----------
        measure  : Measure
----------   Record   ----------
              !  : Start recording
              .  : Stop recording
         screen  : Take screenshot
----------    Help    ----------
              q  : Exit
              ?  : List commands
             ??  : List command parameters
#+end_example



** *TBD* Architecture 

*TBD*


** Documentation references

- Hello World example:  [[file:HELLO.org]]
- Hello World example integrated with ~ebMenu~: [[file:EBMENU.org]]
- BDD testig document for ~ebUnit~ -tool: [[file:ebUnit.org]]
- A short story of slowly climbing the hill from interactive use,
  command line use, configuration file use to Python scripting:
  [[file:GENTLE_SLOPE.org]]
- Template with an example of instrument controller for Rigol
  MSO1104Z: [[file:TEMPLATE.org]]


** Installation
   :PROPERTIES:
   :header-args:bash: :dir  tmp
   :END:


*** Clone repo ~https://github.com/jarjuk/ebench~

#+BEGIN_SRC bash :eval no-export :results output :exports none
# Ensure correct directory
pwd
#+END_SRC

#+RESULTS:
: /home/jj/work/ebench/tmp

#+BEGIN_SRC bash :eval no-export :results output :exports none
# Cleanup previous installation
rm -rf ebench
#+END_SRC

#+RESULTS:

 Clone repo
 #+BEGIN_SRC bash :eval no-export :results output :exports code
 git clone https://github.com/jarjuk/ebench
 #+END_SRC

 #+RESULTS:


*** Check ~ebench~ VERSION -file

 #+BEGIN_SRC bash :eval no-export :results output :exports both
 cat ebench/VERSION
 #+END_SRC

 #+RESULTS:
 : 0.0.10-pre5


*** Check release notes

 #+BEGIN_SRC bash :eval no :results output :exports code
 cat ebench/RELEASES.md
 #+END_SRC


*** Install ~ebench~ 
    :PROPERTIES:
    :header-args:bash: :dir  tmp/ebench
    :END:

 Change working directory to  ~ebench~

 #+BEGIN_SRC 
 cd ebench
 #+END_SRC

 and create distribution package into ~dist~ -sub directory

  #+BEGIN_SRC bash :eval no-export :results output :exports code
  python3 setup.py  sdist  bdist_wheel
  #+END_SRC

  #+RESULTS:
  #+begin_example
  version 0.0.10-pre5 , packages ['ebench']
  running sdist
  running egg_info
  writing ebench.egg-info/PKG-INFO
  writing dependency_links to ebench.egg-info/dependency_links.txt
  writing entry points to ebench.egg-info/entry_points.txt
  writing requirements to ebench.egg-info/requires.txt
  writing top-level names to ebench.egg-info/top_level.txt
  reading manifest file 'ebench.egg-info/SOURCES.txt'
  writing manifest file 'ebench.egg-info/SOURCES.txt'
  running check
  creating ebench-0.0.10rc5
  creating ebench-0.0.10rc5/ebench
  creating ebench-0.0.10rc5/ebench.egg-info
  copying files to ebench-0.0.10rc5...
  copying setup.py -> ebench-0.0.10rc5
  copying ebench/CMDS.py -> ebench-0.0.10rc5/ebench
  copying ebench/Rigol.py -> ebench-0.0.10rc5/ebench
  copying ebench/Unit.py -> ebench-0.0.10rc5/ebench
  copying ebench/__init__.py -> ebench-0.0.10rc5/ebench
  copying ebench/ebMenu.py -> ebench-0.0.10rc5/ebench
  copying ebench/ebMenu.yaml -> ebench-0.0.10rc5/ebench
  copying ebench/ebRigol.py -> ebench-0.0.10rc5/ebench
  copying ebench/ebRigol_main.py -> ebench-0.0.10rc5/ebench
  copying ebench/ebUnit.py -> ebench-0.0.10rc5/ebench
  copying ebench/ebUnit_main.py -> ebench-0.0.10rc5/ebench
  copying ebench/ebench.py -> ebench-0.0.10rc5/ebench
  copying ebench/hello.py -> ebench-0.0.10rc5/ebench
  copying ebench.egg-info/PKG-INFO -> ebench-0.0.10rc5/ebench.egg-info
  copying ebench.egg-info/SOURCES.txt -> ebench-0.0.10rc5/ebench.egg-info
  copying ebench.egg-info/dependency_links.txt -> ebench-0.0.10rc5/ebench.egg-info
  copying ebench.egg-info/entry_points.txt -> ebench-0.0.10rc5/ebench.egg-info
  copying ebench.egg-info/requires.txt -> ebench-0.0.10rc5/ebench.egg-info
  copying ebench.egg-info/top_level.txt -> ebench-0.0.10rc5/ebench.egg-info
  copying ebench.egg-info/zip-safe -> ebench-0.0.10rc5/ebench.egg-info
  copying ebench/../RELEASES.md -> ebench-0.0.10rc5/ebench/..
  copying ebench/../VERSION -> ebench-0.0.10rc5/ebench/..
  Writing ebench-0.0.10rc5/setup.cfg
  Creating tar archive
  removing 'ebench-0.0.10rc5' (and everything under it)
  running bdist_wheel
  running build
  running build_py
  installing to build/bdist.linux-x86_64/wheel
  running install
  running install_lib
  creating build/bdist.linux-x86_64/wheel
  creating build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/CMDS.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/Rigol.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/ebRigol_main.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/ebMenu.yaml -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/ebUnit.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/ebMenu.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/Unit.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/hello.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/ebRigol.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/__init__.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/ebench.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/ebench/ebUnit_main.py -> build/bdist.linux-x86_64/wheel/ebench
  copying build/lib/VERSION -> build/bdist.linux-x86_64/wheel
  copying build/lib/RELEASES.md -> build/bdist.linux-x86_64/wheel
  running install_egg_info
  Copying ebench.egg-info to build/bdist.linux-x86_64/wheel/ebench-0.0.10rc5-py3.9.egg-info
  running install_scripts
  creating build/bdist.linux-x86_64/wheel/ebench-0.0.10rc5.dist-info/WHEEL
  creating 'dist/ebench-0.0.10rc5-py3-none-any.whl' and adding 'build/bdist.linux-x86_64/wheel' to it
  adding 'RELEASES.md'
  adding 'VERSION'
  adding 'ebench/CMDS.py'
  adding 'ebench/Rigol.py'
  adding 'ebench/Unit.py'
  adding 'ebench/__init__.py'
  adding 'ebench/ebMenu.py'
  adding 'ebench/ebMenu.yaml'
  adding 'ebench/ebRigol.py'
  adding 'ebench/ebRigol_main.py'
  adding 'ebench/ebUnit.py'
  adding 'ebench/ebUnit_main.py'
  adding 'ebench/ebench.py'
  adding 'ebench/hello.py'
  adding 'ebench-0.0.10rc5.dist-info/METADATA'
  adding 'ebench-0.0.10rc5.dist-info/WHEEL'
  adding 'ebench-0.0.10rc5.dist-info/entry_points.txt'
  adding 'ebench-0.0.10rc5.dist-info/top_level.txt'
  adding 'ebench-0.0.10rc5.dist-info/zip-safe'
  adding 'ebench-0.0.10rc5.dist-info/RECORD'
  removing build/bdist.linux-x86_64/wheel
  #+end_example

Check distribution package files created in ~dist~ directory:

#+BEGIN_SRC bash :eval no-export :results output :exports both
ls -ltr dist
#+END_SRC

#+RESULTS:
: total 68
: -rw-rw-r-- 1 jj jj 31438 huhti 27 21:54 ebench-0.0.10rc5.tar.gz
: -rw-rw-r-- 1 jj jj 36142 huhti 27 21:54 ebench-0.0.10rc5-py3-none-any.whl


 To install the latest version found in ~dist~ directory run

  #+BEGIN_SRC bash :eval no-export :results output :exports code
  VERSION_FILE=$(ls -1tr dist/*.tar.gz | tail -1| cut -f2)
  echo VERSION_FILE=$VERSION_FILE
  python3 -m pip install --user $VERSION_FILE  && echo installed $VERSION_FILE
  #+END_SRC

  #+RESULTS:
  #+begin_example
  VERSION_FILE=dist/ebench-0.0.10rc5.tar.gz
  Processing ./dist/ebench-0.0.10rc5.tar.gz
  Requirement already satisfied: pyvisa-py in /home/jj/.local/lib/python3.9/site-packages (from ebench==0.0.10rc5) (0.5.2)
  Requirement already satisfied: absl-py in /home/jj/.local/lib/python3.9/site-packages (from ebench==0.0.10rc5) (0.12.0)
  Requirement already satisfied: six in /home/jj/.local/lib/python3.9/site-packages (from absl-py->ebench==0.0.10rc5) (1.15.0)
  Requirement already satisfied: typing-extensions in /home/jj/.local/lib/python3.9/site-packages (from pyvisa-py->ebench==0.0.10rc5) (3.7.4.3)
  Requirement already satisfied: pyvisa>=1.11.0 in /home/jj/.local/lib/python3.9/site-packages (from pyvisa-py->ebench==0.0.10rc5) (1.11.3)
  Building wheels for collected packages: ebench
    Building wheel for ebench (setup.py): started
    Building wheel for ebench (setup.py): finished with status 'done'
    Created wheel for ebench: filename=ebench-0.0.10rc5-py3-none-any.whl size=36142 sha256=07bdf039d6994d75338ec4da6ac5d4cdf58eaf7838a9f3793cace3a7574df96d
    Stored in directory: /home/jj/.cache/pip/wheels/8d/02/08/cfc3a36bae88e51c539d93d049c095785ac537f4dbac91cc53
  Successfully built ebench
  Installing collected packages: ebench
    Attempting uninstall: ebench
      Found existing installation: ebench 0.0.10-SNAPSHOT
      Uninstalling ebench-0.0.10-SNAPSHOT:
        Successfully uninstalled ebench-0.0.10-SNAPSHOT
  Successfully installed ebench-0.0.10rc5
  installed dist/ebench-0.0.10rc5.tar.gz
  #+end_example


*** Check installation

 Run

 #+name: install_version
 #+BEGIN_SRC bash :eval no-export :results output :noweb yes :exports both
 ebMenu _version
 #+END_SRC

 and expect to see same version number noticed in ~VERSION~ -file
 above

 #+RESULTS: install_version
 : 0.0.10-pre5



*** Check list resources 

 Use command ~_list_resources~ to list VISA resource found by pyvisa tool 

 #+name: list_resources
 #+BEGIN_SRC bash :eval no-export :results output :noweb yes :exports both
 ebMenu  _list_resources
 #+END_SRC

 In development environment it returns:

 #+RESULTS: list_resources
 : ('USB0::26198::2100::1485061822::0::INSTR',)


*** Use it

#+BEGIN_SRC bash :eval no-export :results output
ebMenu --debug=1  '?' 
#+END_SRC

#+RESULTS:
#+begin_example
ebMenu: Menu of ebench toolset

Usage: ebMenu [options] [commands and parameters] 

Commands:

        skooppi  : Rigol osciloscope control
           sgen  : UNIT-T UTG962 signal generator control
              q  : Exit
----------   Other    ----------
              ?  : List commands
             ??  : List command parameters
              !  : Start recording
              .  : Stop recording
#+end_example




** *TBD* Usage

*TDB*

*** Interactive usage

~ebench~ -tools  should give usage instructions with ~?~ -command.

For example running 

#+BEGIN_SRC bash :eval no-export :results output :exports both :noweb yes
cat <<EOF | ebMenu
?
q
EOF
#+END_SRC

#+RESULTS:
#+begin_example
[?=help, q=quit] > ebMenu: Menu of ebench toolset

Usage: ebMenu [options] [commands and parameters] 

Commands:

        skooppi  : Rigol osciloscope control
           sgen  : UNIT-T UTG962 signal generator control
       counters  : Read hello.py counters
   counters2csv  : Save hello.py counters to example.csv
              q  : Exit
----------   Other    ----------
              ?  : List commands
             ??  : List command parameters
              !  : Start recording
              .  : Stop recording
[?=help, q=quit] > 
#+end_example


*** Command line usage

#+BEGIN_SRC bash :eval no-export :results output :noweb yes
<<ebMenu>> ? 
#+END_SRC

#+RESULTS:
#+begin_example
ebMenu: Menu of ebench toolset

Usage: ebMenu [options] [commands and parameters] 

Commands:

        skooppi  : Rigol osciloscope control
           sgen  : UNIT-T UTG962 signal generator control
       counters  : Read hello.py counters
   counters2csv  : Save hello.py counters to example.csv
              q  : Exit
----------   Other    ----------
              ?  : List commands
             ??  : List command parameters
              !  : Start recording
              .  : Stop recording
#+end_example


*** API usage


* Fin                                                              :noexport:


   # Local Variables:
   # org-confirm-babel-evaluate: nil
   # End:



